programmingTutorial07V2406/testCase/cavityMyFunction/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
        {
            // type          forces;
            type          myFunctionObject;

            
            libs          (libmyFunctionObject.so);

            writeControl  timeStep;
            timeInterval  1;

            patches       (movingWall);
            rho           rhoInf;     // Indicates incompressible
            log           true;
            rhoInf        1;          // Redundant for incompressible

            CofR          (0 0 0);    // Rotation around centre line of propeller
            pitchAxis     (0 1 0);
        }

}




// ************************************************************************* //
